01-Res-Latency-hotel-Swarm-1profile/hotel-1profile-machine1/Res-firecracker-set-Swarm-v1-machine1/firecracker_t_10_c_30_frontVcpu_4_wrkVcpu_1_R_1000/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 6.463ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.074ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 6.550ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 5.749ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.000ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 5.917ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.783ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.442ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.110ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 5.782ms, rate sampling interval: 25ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.83ms    4.74ms  21.60ms   84.90%
    Req/Sec    29.36     57.88   238.00     85.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.75ms
 75.000%    7.96ms
 90.000%   12.55ms
 99.000%   21.60ms
 99.900%   31.30ms
 99.990%   41.12ms
 99.999%   45.53ms
100.000%   45.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.708     0.000000            1         1.00
       1.825     0.100000         1443         1.11
       2.321     0.200000         2887         1.25
       2.707     0.300000         4329         1.43
       3.119     0.400000         5775         1.67
       3.753     0.500000         7217         2.00
       4.259     0.550000         7938         2.22
       5.091     0.600000         8655         2.50
       6.075     0.650000         9380         2.86
       6.983     0.700000        10098         3.33
       7.963     0.750000        10821         4.00
       8.535     0.775000        11185         4.44
       9.143     0.800000        11543         5.00
       9.807     0.825000        11902         5.71
      10.607     0.850000        12265         6.67
      11.455     0.875000        12623         8.00
      11.959     0.887500        12803         8.89
      12.551     0.900000        12983        10.00
      13.135     0.912500        13164        11.43
      13.887     0.925000        13348        13.33
      14.735     0.937500        13524        16.00
      15.247     0.943750        13616        17.78
      15.727     0.950000        13704        20.00
      16.263     0.956250        13794        22.86
      16.783     0.962500        13885        26.67
      17.599     0.968750        13975        32.00
      17.967     0.971875        14020        35.56
      18.543     0.975000        14066        40.00
      19.119     0.978125        14113        45.71
      19.487     0.981250        14156        53.33
      20.143     0.984375        14201        64.00
      20.479     0.985938        14223        71.11
      20.895     0.987500        14245        80.00
      21.311     0.989062        14269        91.43
      21.919     0.990625        14290       106.67
      22.655     0.992188        14313       128.00
      22.959     0.992969        14324       142.22
      23.423     0.993750        14335       160.00
      23.807     0.994531        14347       182.86
      24.383     0.995313        14358       213.33
      25.183     0.996094        14369       256.00
      25.551     0.996484        14375       284.44
      26.079     0.996875        14380       320.00
      26.831     0.997266        14387       365.71
      27.327     0.997656        14392       426.67
      27.823     0.998047        14397       512.00
      28.223     0.998242        14400       568.89
      28.671     0.998437        14403       640.00
      30.063     0.998633        14406       731.43
      30.911     0.998828        14409       853.33
      31.295     0.999023        14411      1024.00
      31.935     0.999121        14413      1137.78
      32.175     0.999219        14414      1280.00
      32.495     0.999316        14416      1462.86
      33.631     0.999414        14417      1706.67
      33.919     0.999512        14418      2048.00
      34.015     0.999561        14419      2275.56
      35.903     0.999609        14420      2560.00
      36.639     0.999658        14421      2925.71
      36.639     0.999707        14421      3413.33
      36.735     0.999756        14422      4096.00
      36.735     0.999780        14422      4551.11
      38.303     0.999805        14423      5120.00
      38.303     0.999829        14423      5851.43
      38.303     0.999854        14423      6826.67
      41.119     0.999878        14424      8192.00
      41.119     0.999890        14424      9102.22
      41.119     0.999902        14424     10240.00
      41.119     0.999915        14424     11702.86
      41.119     0.999927        14424     13653.33
      45.535     0.999939        14425     16384.00
      45.535     1.000000        14425          inf
#[Mean    =        5.827, StdDeviation   =        4.739]
#[Max     =       45.504, Total count    =        14425]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24342 requests in 1.00m, 10.05MB read
Requests/sec:    405.63
Transfer/sec:    171.48KB